package com.example.testmethod;

/**
 * Created by Mslab on 2017/12/21.
 */

public class TrainingData_HandleObject {
    private static final String TRAININGDATA = "@relation ads\n" +
            "\n" +
            "@attribute moti_x_acc_mean numeric\n" +
            "@attribute moti_y_acc_mean numeric\n" +
            "@attribute moti_z_acc_mean numeric\n" +
            "@attribute moti_x_acc_SD numeric\n" +
            "@attribute moti_y_acc_SD numeric\n" +
            "@attribute moti_z_acc_SD numeric\n" +
            "@attribute imu_x_acc_mean numeric\n" +
            "@attribute imu_y_acc_mean numeric\n" +
            "@attribute imu_z_acc_mean numeric\n" +
            "@attribute imu_x_acc_SD numeric\n" +
            "@attribute imu_y_acc_SD numeric\n" +
            "@attribute imu_z_acc_SD numeric\n" +
            "@attribute emg_0_mean numeric\n" +
            "@attribute emg_1_mean numeric\n" +
            "@attribute emg_2_mean numeric\n" +
            "@attribute emg_3_mean numeric\n" +
            "@attribute emg_4_mean numeric\n" +
            "@attribute emg_5_mean numeric\n" +
            "@attribute emg_6_mean numeric\n" +
            "@attribute emg_7_mean numeric\n" +
            "@attribute profit {伸手, 拿東西, 將東西向右移, 將東西向左移, 喝水(拿起), 喝水(放下)}\n" +
            "\n" +
            "@data\n" +
            "0.520787689,0.478482169,0.551911326,0.000434893,0.000375168,0.000359137,0.503543598,0.485608386,0.524354913,0.013524601,0.005727823,0.004263517,0.039442423,0.048761869,0.109034485,0.136900867,0.041277435,0.016355759,0.015213585,0.017726862,伸手\n" +
            "0.528495145,0.485315432,0.550670697,0.000467191,0.000495322,0.000343977,0.504635273,0.480705562,0.523135407,0.002814473,0.001381173,0.001433812,0.023351884,0.05282026,0.060075447,0.125556034,0.031794584,0.02365851,0.028554641,0.015211935,拿東西\n" +
            "0.524221094,0.466154269,0.543052462,0.000831567,0.000455532,0.000708986,0.506602871,0.485931604,0.526301306,0.001379504,0.001638086,0.001559534,0.019110287,0.027814368,0.08323206,0.110053492,0.031368773,0.017742636,0.020700355,0.011779217,將東西向右移\n" +
            "0.525342162,0.468574726,0.544103364,0.001173393,0.001997122,0.000878187,0.507970759,0.488002358,0.526679349,0.002017435,0.002812338,0.00113821,0.019704028,0.051668051,0.05942729,0.092216344,0.026042418,0.013458484,0.014810798,0.023608339,將東西向左移\n" +
            "0.522392986,0.473915382,0.548974377,0.000751601,0.00077837,0.000445419,0.485511691,0.501351585,0.519158776,0.010977052,0.013982664,0.008345272,0.078627213,0.08436754,0.11855141,0.089039687,0.04326253,0.040259188,0.059042361,0.036440915,喝水(拿起)\n" +
            "0.521243875,0.476187356,0.550602409,0.001169578,0.000768221,0.000720077,0.489772745,0.493464869,0.521631581,0.011493336,0.012959013,0.007409172,0.114755192,0.058417994,0.091712729,0.152012641,0.053137678,0.025184101,0.047049394,0.093838473,喝水(放下)\n";
    public String getTrainingData(){
        return TRAININGDATA;
    }
}
